<a href="https://colab.research.google.com/github/DEEPTHIA29/Code/blob/master/PANDAS_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

AGGREGATE FUNCTION ON PANDAS SERIES

Pandas Series.aggregate() function aggregate using one or more operations

In [3]:
S=pd.Series([1,2,3,4,5,6,7])
S.aggregate(['min','max','sum'])

min     1
max     7
sum    28
dtype: int64

SERIES ABSOLUTE FUNCTION

Pandas Series.abs() method is used to get the absolute numeric value of each element in series/DataFrame

In [4]:
sr=pd.Series([1,-2,1,-5,6,7,-9])
sr.abs()

0    1
1    2
2    1
3    5
4    6
5    7
6    9
dtype: int64

APPENDING SERIES

Pandas Series.append() function is used to concatenate two or more series object

ASTYPE() FUNCTION

Change the data type of series

In [8]:
sr1.astype('float')

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    8.0
dtype: float64

BETWEEN FUNCTION

Pandas between() method is used on series to check which values lie between first and second argument

In [10]:
sr1=pd.Series([1,2,3,4,5,6,7,8,9,10])
sr1.between(5,7)

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7    False
8    False
9    False
dtype: bool